// Lab_03_1.cpp
// < Косанюк Богдан >
// Лабораторна робота № 3.1
// Розгалуження, задане формулою: функція однієї змінної.
// Варіант 11
#include <iostream> // директива препроцесора потрібна для роботи "cout" і "cin"
#include <cmath> // директива препроцесора потрібна для роботи "sin", tan", "atan", "pow"
using namespace std; // інструкція для використання std (cout, cin, endl)без префікса std::
int main() // заголовок головної функціх програми
{ // початок меж блоку коду
	double x; // вхідний параметр
	double y; // результат обчислення виразу
	double A; // проміжний результат - функціонально стала частина виразу
	double B; // проміжний результат - функціонально змінна частина виразу
	cout << "x = "; cin >> x; // поле для введення значення "х"
	A = 2 * fabs(5 - x); // ф-ла обчислення зменшуваного
	
	// спосіб 1: розгалуження в скороченій формі
	if (x <= -1) // якщо "х" менше або дорівнює -1
		B = exp(fabs(2 + x)); // значення "у" при х<=-1 
	if (-1 < x && x < 1) // якщо "х" знаходиться між -1 та 1
		B = pow(sin(1./fabs(2 + x)), 2); // значення "у" при "х" в межах (-1 ; 1)
	if (x >= 1) // якщо "х" більше або дорівнює 1
		B = (pow(cos(x), 2)) / (1 + fabs(sin(x))); // значення "у" при х>=1
	y = A - B; // обчислення остаточного результату
	cout << endl; // виведення порожнього рядка
	cout << "1) y = " << y << endl; // виведення значення "у"
	
	// спосіб 2: розгалуження в повній формі
	if (x <= -1) // якщо "х" менше або дорівнює -1
		B = exp(fabs(2 + x)); // значення "у" при х<=-1 
	else // інакше
		if (x >= 1) // якщо "х" більше або дорівнює 1
			B = (pow(cos(x), 2)) / (1 + fabs(sin(x))); // значення "у" при х>=1 
		else // інакше
			B = pow(sin(1. / fabs(2 + x)), 2); // значення "у" при "х" в межах (-1 ; 1)
	y = A - B; // обчислення остаточного результату
	cout << "2) y = " << y << endl; // виведення значення "у"
	cin.get(); // функція очікування натискання клавіші
	return 0; // завершення програми
} // кінець меж блоку коду